deploy/jmeter/results/html-report/statistics.json
{
  "GET /api/contents?page=1&pageSize=20" : {
    "transaction" : "GET /api/contents?page=1&pageSize=20",
    "sampleCount" : 2400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.732499999999984,
    "medianResTime" : 20.0,
    "minResTime" : 9.0,
    "maxResTime" : 123.0,
    "pct1ResTime" : 33.0,
    "pct2ResTime" : 39.0,
    "pct3ResTime" : 60.0,
    "throughput" : 115.47899725737382,
    "receivedKBytesPerSec" : 386.33118865178267,
    "sentKBytesPerSec" : 23.118353943126593
  },
  "GET /api/feed/recommend?pageSize=20" : {
    "transaction" : "GET /api/feed/recommend?pageSize=20",
    "sampleCount" : 2400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.275,
    "medianResTime" : 17.0,
    "minResTime" : 7.0,
    "maxResTime" : 332.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 48.94999999999982,
    "pct3ResTime" : 105.0,
    "throughput" : 117.39385638818236,
    "receivedKBytesPerSec" : 341.1357702748973,
    "sentKBytesPerSec" : 57.482673706221874
  },
  "GET /api/contents/90002/like-status" : {
    "transaction" : "GET /api/contents/90002/like-status",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.0,
    "medianResTime" : 16.0,
    "minResTime" : 16.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 16.0,
    "throughput" : 62.5,
    "receivedKBytesPerSec" : 33.02001953125,
    "sentKBytesPerSec" : 26.30615234375
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 12205,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.10839819746005,
    "medianResTime" : 8.0,
    "minResTime" : 1.0,
    "maxResTime" : 332.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 58.69999999999891,
    "pct3ResTime" : 138.0,
    "throughput" : 555.6314303924247,
    "receivedKBytesPerSec" : 1049.2338034490804,
    "sentKBytesPerSec" : 141.51744813006465
  },
  "POST /api/auth/login" : {
    "transaction" : "POST /api/auth/login",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 130.5739999999999,
    "medianResTime" : 126.0,
    "minResTime" : 102.0,
    "maxResTime" : 249.0,
    "pct1ResTime" : 150.0,
    "pct2ResTime" : 175.69999999999993,
    "pct3ResTime" : 216.97000000000003,
    "throughput" : 31.080997078386275,
    "receivedKBytesPerSec" : 22.096646360415242,
    "sentKBytesPerSec" : 7.679191660968484
  },
  "DELETE /api/contents/90002/like" : {
    "transaction" : "DELETE /api/contents/90002/like",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 46.0,
    "medianResTime" : 46.0,
    "minResTime" : 46.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 46.0,
    "pct2ResTime" : 46.0,
    "pct3ResTime" : 46.0,
    "throughput" : 21.73913043478261,
    "receivedKBytesPerSec" : 9.213654891304348,
    "sentKBytesPerSec" : 10.97571331521739
  },
  "GET /api/hotrank/all?limit=20" : {
    "transaction" : "GET /api/hotrank/all?limit=20",
    "sampleCount" : 4500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.692888888888889,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 86.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 29.0,
    "throughput" : 289.55665658580534,
    "receivedKBytesPerSec" : 361.89115183225016,
    "sentKBytesPerSec" : 55.98849414452094
  },
  "POST /api/contents" : {
    "transaction" : "POST /api/contents",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 48.0,
    "medianResTime" : 48.0,
    "minResTime" : 48.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 48.0,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 48.0,
    "throughput" : 20.833333333333332,
    "receivedKBytesPerSec" : 11.027018229166666,
    "sentKBytesPerSec" : 11.8408203125
  },
  "POST /api/contents/90002/like" : {
    "transaction" : "POST /api/contents/90002/like",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 47.0,
    "medianResTime" : 47.0,
    "minResTime" : 47.0,
    "maxResTime" : 47.0,
    "pct1ResTime" : 47.0,
    "pct2ResTime" : 47.0,
    "pct3ResTime" : 47.0,
    "throughput" : 21.27659574468085,
    "receivedKBytesPerSec" : 9.017619680851064,
    "sentKBytesPerSec" : 10.70063164893617
  },
  "POST /api/auth/login for JWT" : {
    "transaction" : "POST /api/auth/login for JWT",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 166.0,
    "medianResTime" : 166.0,
    "minResTime" : 166.0,
    "maxResTime" : 166.0,
    "pct1ResTime" : 166.0,
    "pct2ResTime" : 166.0,
    "pct3ResTime" : 166.0,
    "throughput" : 6.024096385542169,
    "receivedKBytesPerSec" : 4.282756024096385,
    "sentKBytesPerSec" : 1.488375376506024
  },
  "GET /api/tags/hot?limit=12" : {
    "transaction" : "GET /api/tags/hot?limit=12",
    "sampleCount" : 2400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.85916666666668,
    "medianResTime" : 5.0,
    "minResTime" : 2.0,
    "maxResTime" : 72.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 18.0,
    "throughput" : 237.0604504148558,
    "receivedKBytesPerSec" : 203.66787769162386,
    "sentKBytesPerSec" : 45.143347491110234
  }
}